Ran Plan for dir: `environment/test` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '/atlantis-data/bin/terraform1.12.2 plan -input=false -refresh -out "/atlantis-data/repos/shwetaec12/eks-atlantis-demo/6/default/environment/test/default.tfplan"' in '/atlantis-data/repos/shwetaec12/eks-atlantis-demo/6/default/environment/test': exit status 1
module.eks.data.aws_partition.current: Reading...
aws_iam_openid_connect_provider.oidc: Refreshing state... [id=arn:aws:iam::895976263444:oidc-provider/oidc.eks.eu-central-1.amazonaws.com/id/3BFFE8CF83A9EF9B9503868907B06C39]
data.aws_iam_policy_document.eks_node_group_assume: Reading...
module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/my-eks-cluster/cluster]
module.eks.data.aws_caller_identity.current: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0f71346aacb10106d]
module.eks.module.kms.data.aws_caller_identity.current[0]: Reading...
module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.kms.data.aws_partition.current[0]: Reading...
data.aws_iam_policy_document.eks_node_group_assume: Read complete after 0s [id=2851119427]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
aws_iam_role.node_group_role: Refreshing state... [id=eks-node-group-role]
module.eks.aws_iam_role.this[0]: Refreshing state... [id=my-eks-cluster-cluster-20250608205255912900000001]
module.eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=895976263444]
module.eks.data.aws_caller_identity.current: Read complete after 0s [id=895976263444]
module.eks.data.aws_iam_session_context.current: Reading...
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-02583f947ec11ddbf]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-07c46d6e13ca85fa7]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0187482a5ab4e0656]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0822587ed33e5ad5b]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-06c5664430fc0a4e9]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-03a1d9a327675dcf1]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0def7ffa6b913c78d]
module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-0e7f428dc156bc738]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-06d2c5bdb823d7607]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-072ac13db18cc7f7a]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-04649c48c8480f7bc]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0cef3ac3aede352ef]
module.eks.data.aws_iam_session_context.current: Read complete after 1s [id=arn:aws:sts::895976263444:assumed-role/atlantis-irsa-role/1749935714143944277]
data.aws_iam_policy_document.eks_admin_assume: Reading...
data.aws_iam_policy_document.eks_admin_assume: Read complete after 0s [id=1245921462]
aws_iam_role.eks_admin: Refreshing state... [id=eks-admin]
aws_iam_role_policy_attachment.node_group_worker_node: Refreshing state... [id=eks-node-group-role-20250608205256668700000004]
aws_iam_role_policy_attachment.node_group_cni_policy: Refreshing state... [id=eks-node-group-role-20250608205256683500000005]
aws_iam_role_policy_attachment.node_group_ecr_readonly: Refreshing state... [id=eks-node-group-role-20250608205256637300000003]
module.eks.module.eks_managed_node_group["default"].data.aws_partition.current: Reading...
module.eks.module.eks_managed_node_group["default"].data.aws_caller_identity.current: Reading...
module.eks.module.eks_managed_node_group["default"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=my-eks-cluster-cluster-20250608205255912900000001-20250608205256988900000008]
module.eks.module.eks_managed_node_group["default"].data.aws_caller_identity.current: Read complete after 0s [id=895976263444]
module.eks.module.eks_managed_node_group["default"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=my-eks-cluster-cluster-20250608205255912900000001-20250608205256970600000007]
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=2157275577]
module.eks.module.eks_managed_node_group["default"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
aws_iam_role_policy_attachment.eks_admin_attach: Refreshing state... [id=eks-admin-20250608205256961200000006]
module.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=6117f541-22d6-46a9-a5a5-fad4c72805ee]
module.eks.module.eks_managed_node_group["default"].aws_iam_role.this[0]: Refreshing state... [id=default-eks-node-group-20250608205256535500000002]
module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=default-eks-node-group-20250608205256535500000002-20250608205257211700000009]
module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=default-eks-node-group-20250608205256535500000002-2025060820525722780000000b]
module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=default-eks-node-group-20250608205256535500000002-2025060820525722440000000a]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.vpc.aws_vpc.this[0] has changed
  ~ resource "aws_vpc" "this" {
      - default_route_table_id               = "rtb-0187482a5ab4e0656" -> null
      - default_security_group_id            = "sg-02583f947ec11ddbf" -> null
        id                                   = "vpc-0f71346aacb10106d"
      - main_route_table_id                  = "rtb-0187482a5ab4e0656" -> null
        tags                                 = {
            "Environment" = "production"
            "Name"        = "eks-vpc-test"
        }
        # (16 unchanged attributes hidden)
    }

  # module.eks.module.eks_managed_node_group["default"].aws_iam_role.this[0] has been deleted
  - resource "aws_iam_role" "this" {
      - arn                   = "arn:aws:iam::895976263444:role/default-eks-node-group-20250608205256535500000002" -> null
        id                    = "default-eks-node-group-20250608205256535500000002"
      - name                  = "default-eks-node-group-20250608205256535500000002" -> null
        tags                  = {
            "Environment" = "production"
        }
      - unique_id             = "AROA5BHCYZ4KD4SVTM553" -> null
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.eks.module.eks_managed_node_group["default"].aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "EKSNodeAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "EKS managed node group IAM role"
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "default-eks-node-group-"
      + path                  = "/"
      + tags                  = {
          + "Environment" = "production"
        }
      + tags_all              = {
          + "Environment" = "production"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.
╷
│ Warning: Argument is deprecated
│ 
│   with module.eks.aws_iam_role.this[0],
│   on .terraform/modules/eks/main.tf line 293, in resource "aws_iam_role" "this":
│  293: resource "aws_iam_role" "this" {
│ 
│ inline_policy is deprecated. Use the aws_iam_role_policy resource instead.
│ If Terraform should exclusively manage all inline policy associations (the
│ current behavior of this argument), use the aws_iam_role_policies_exclusive
│ resource as well.
╵
╷
│ Error: reading KMS Key (6117f541-22d6-46a9-a5a5-fad4c72805ee): reading KMS Key (6117f541-22d6-46a9-a5a5-fad4c72805ee): operation error KMS: DescribeKey, https response error StatusCode: 400, RequestID: e493f68f-39a7-44cc-86fd-92b145dbd9ba, api error AccessDeniedException: User: arn:aws:sts::895976263444:assumed-role/atlantis-irsa-role/1749935714143944277 is not authorized to perform: kms:DescribeKey on resource: arn:aws:kms:eu-central-1:895976263444:key/6117f541-22d6-46a9-a5a5-fad4c72805ee because no resource-based policy allows the kms:DescribeKey action
│ 
│   with module.eks.module.kms.aws_kms_key.this[0],
│   on .terraform/modules/eks.kms/main.tf line 18, in resource "aws_kms_key" "this":
│   18: resource "aws_kms_key" "this" {
│ 
╵
╷
│ Error: reading Security Group (sg-0822587ed33e5ad5b): operation error EC2: DescribeSecurityGroups, https response error StatusCode: 403, RequestID: f6e1ee1d-c3c3-49aa-ba77-3f9b37b10e2a, api error UnauthorizedOperation: You are not authorized to perform this operation. User: arn:aws:sts::895976263444:assumed-role/atlantis-irsa-role/1749935714143944277 is not authorized to perform: ec2:DescribeSecurityGroups because no identity-based policy allows the ec2:DescribeSecurityGroups action
│ 
│   with module.eks.aws_security_group.cluster[0],
│   on .terraform/modules/eks/main.tf line 178, in resource "aws_security_group" "cluster":
│  178: resource "aws_security_group" "cluster" {
│ 
╵
╷
│ Error: reading Security Group (sg-0e7f428dc156bc738): operation error EC2: DescribeSecurityGroups, https response error StatusCode: 403, RequestID: 582d314b-ffad-4b2a-b6d6-c6f693626fdc, api error UnauthorizedOperation: You are not authorized to perform this operation. User: arn:aws:sts::895976263444:assumed-role/atlantis-irsa-role/1749935714143944277 is not authorized to perform: ec2:DescribeSecurityGroups because no identity-based policy allows the ec2:DescribeSecurityGroups action
│ 
│   with module.eks.aws_security_group.node[0],
│   on .terraform/modules/eks/node_groups.tf line 185, in resource "aws_security_group" "node":
│  185: resource "aws_security_group" "node" {
│ 
╵
╷
│ Error: reading EC2 Subnet (subnet-06d2c5bdb823d7607): operation error EC2: DescribeSubnets, https response error StatusCode: 403, RequestID: 590fb7ec-82f2-493a-877e-24e40fc0c809, api error UnauthorizedOperation: You are not authorized to perform this operation. User: arn:aws:sts::895976263444:assumed-role/atlantis-irsa-role/1749935714143944277 is not authorized to perform: ec2:DescribeSubnets because no identity-based policy allows the ec2:DescribeSubnets action
│ 
│   with module.vpc.aws_subnet.public[0],
│   on .terraform/modules/vpc/main.tf line 98, in resource "aws_subnet" "public":
│   98: resource "aws_subnet" "public" {
│ 
╵
╷
│ Error: reading EC2 Subnet (subnet-072ac13db18cc7f7a): operation error EC2: DescribeSubnets, https response error StatusCode: 403, RequestID: 48796edd-f995-4814-915e-865780ab165d, api error UnauthorizedOperation: You are not authorized to perform this operation. User: arn:aws:sts::895976263444:assumed-role/atlantis-irsa-role/1749935714143944277 is not authorized to perform: ec2:DescribeSubnets because no identity-based policy allows the ec2:DescribeSubnets action
│ 
│   with module.vpc.aws_subnet.public[1],
│   on .terraform/modules/vpc/main.tf line 98, in resource "aws_subnet" "public":
│   98: resource "aws_subnet" "public" {
│ 
╵
╷
│ Error: reading Route Table (rtb-0def7ffa6b913c78d): operation error EC2: DescribeRouteTables, https response error StatusCode: 403, RequestID: 669276c3-4f89-470e-8419-058dcbe1e812, api error UnauthorizedOperation: You are not authorized to perform this operation. User: arn:aws:sts::895976263444:assumed-role/atlantis-irsa-role/1749935714143944277 is not authorized to perform: ec2:DescribeRouteTables because no identity-based policy allows the ec2:DescribeRouteTables action
│ 
│   with module.vpc.aws_route_table.public[0],
│   on .terraform/modules/vpc/main.tf line 131, in resource "aws_route_table" "public":
│  131: resource "aws_route_table" "public" {
│ 
╵
╷
│ Error: reading EC2 Subnet (subnet-06c5664430fc0a4e9): operation error EC2: DescribeSubnets, https response error StatusCode: 403, RequestID: 4a300278-3218-467d-a1a1-d169b80f76d4, api error UnauthorizedOperation: You are not authorized to perform this operation. User: arn:aws:sts::895976263444:assumed-role/atlantis-irsa-role/1749935714143944277 is not authorized to perform: ec2:DescribeSubnets because no identity-based policy allows the ec2:DescribeSubnets action
│ 
│   with module.vpc.aws_subnet.private[1],
│   on .terraform/modules/vpc/main.tf line 234, in resource "aws_subnet" "private":
│  234: resource "aws_subnet" "private" {
│ 
╵
╷
│ Error: reading EC2 Subnet (subnet-03a1d9a327675dcf1): operation error EC2: DescribeSubnets, https response error StatusCode: 403, RequestID: 22aa9365-55fe-4a6b-a0f3-a255d3a28e8c, api error UnauthorizedOperation: You are not authorized to perform this operation. User: arn:aws:sts::895976263444:assumed-role/atlantis-irsa-role/1749935714143944277 is not authorized to perform: ec2:DescribeSubnets because no identity-based policy allows the ec2:DescribeSubnets action
│ 
│   with module.vpc.aws_subnet.private[0],
│   on .terraform/modules/vpc/main.tf line 234, in resource "aws_subnet" "private":
│  234: resource "aws_subnet" "private" {
│ 
╵
╷
│ Error: reading Route Table (rtb-0cef3ac3aede352ef): operation error EC2: DescribeRouteTables, https response error StatusCode: 403, RequestID: f593a703-a96d-4835-be64-4e09c2cf878a, api error UnauthorizedOperation: You are not authorized to perform this operation. User: arn:aws:sts::895976263444:assumed-role/atlantis-irsa-role/1749935714143944277 is not authorized to perform: ec2:DescribeRouteTables because no identity-based policy allows the ec2:DescribeRouteTables action
│ 
│   with module.vpc.aws_route_table.private[0],
│   on .terraform/modules/vpc/main.tf line 263, in resource "aws_route_table" "private":
│  263: resource "aws_route_table" "private" {
│ 
╵
╷
│ Error: reading EC2 Internet Gateway (igw-04649c48c8480f7bc): operation error EC2: DescribeInternetGateways, https response error StatusCode: 403, RequestID: 21b9f890-e374-4ef4-8a57-fb941d0fce4f, api error UnauthorizedOperation: You are not authorized to perform this operation. User: arn:aws:sts::895976263444:assumed-role/atlantis-irsa-role/1749935714143944277 is not authorized to perform: ec2:DescribeInternetGateways because no identity-based policy allows the ec2:DescribeInternetGateways action
│ 
│   with module.vpc.aws_internet_gateway.this[0],
│   on .terraform/modules/vpc/main.tf line 1018, in resource "aws_internet_gateway" "this":
│ 1018: resource "aws_internet_gateway" "this" {
│ 
╵
╷
│ Error: reading Security Group (sg-02583f947ec11ddbf): operation error EC2: DescribeSecurityGroups, https response error StatusCode: 403, RequestID: b5b05208-44a1-4d5f-b7d3-a2701f2179f2, api error UnauthorizedOperation: You are not authorized to perform this operation. User: arn:aws:sts::895976263444:assumed-role/atlantis-irsa-role/1749935714143944277 is not authorized to perform: ec2:DescribeSecurityGroups because no identity-based policy allows the ec2:DescribeSecurityGroups action
│ 
│   with module.vpc.aws_default_security_group.this[0],
│   on .terraform/modules/vpc/main.tf line 1232, in resource "aws_default_security_group" "this":
│ 1232: resource "aws_default_security_group" "this" {
│ 
╵
╷
│ Error: reading EC2 Network ACL (acl-07c46d6e13ca85fa7): operation error EC2: DescribeNetworkAcls, https response error StatusCode: 403, RequestID: 99375c7e-646d-466a-961a-2baa1edee2ef, api error UnauthorizedOperation: You are not authorized to perform this operation. User: arn:aws:sts::895976263444:assumed-role/atlantis-irsa-role/1749935714143944277 is not authorized to perform: ec2:DescribeNetworkAcls because no identity-based policy allows the ec2:DescribeNetworkAcls action
│ 
│   with module.vpc.aws_default_network_acl.this[0],
│   on .terraform/modules/vpc/main.tf line 1278, in resource "aws_default_network_acl" "this":
│ 1278: resource "aws_default_network_acl" "this" {
│ 
╵
╷
│ Error: reading Route Table (rtb-0187482a5ab4e0656): operation error EC2: DescribeRouteTables, https response error StatusCode: 403, RequestID: db6a40c4-7b88-434e-aa1d-56a3d75ad9bb, api error UnauthorizedOperation: You are not authorized to perform this operation. User: arn:aws:sts::895976263444:assumed-role/atlantis-irsa-role/1749935714143944277 is not authorized to perform: ec2:DescribeRouteTables because no identity-based policy allows the ec2:DescribeRouteTables action
│ 
│   with module.vpc.aws_default_route_table.default[0],
│   on .terraform/modules/vpc/main.tf line 1331, in resource "aws_default_route_table" "default":
│ 1331: resource "aws_default_route_table" "default" {
│ 
╵

```
</details>